# MEPAnalyticalSegment Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MEPAnalyticalSegment Properties
MEPAnalyticalSegment Class See Also
---
The MEPAnalyticalSegment type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Area | The area of the segment profile. |
| DemandFlow | The designed flow value, in ft^3/s. |
| DomainType | The connector domain type of this segment. |
| EndNode | The id of the end analytical node. |
| Id | The identity of this segment. |
| InnerDiameter | The inner diameter of this segment, in ft. For rectangular or oval profile, this may be the hydraulic diameter. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| RevitElementId | The id of the owning Revit element. |
| Roughness | The roughness of this segment, in ft. |
| SegmentType | The analytical segment type. |
| StartNode | The id of the start analytical node. |

# See Also
MEPAnalyticalSegment Class
Autodesk.Revit.DB.Analysis Namespace